examples/mixer/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.1                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    wall-part_3-solid
    {
        type            noSlip;
	value uniform (0 0 0);
    }
    in1
    {
        type        specifiedMagnitudeAndNormal;
	magnitude    2;
 	value uniform (0 0 0);
   }
    in2
    {
        type         specifiedMagnitudeAndNormal;
	magnitude     2;
	value uniform (0 0 0);

     }
    out
    {
        type            outlet;
	value uniform (0 0 0);
    }
    top
    {
        type            noSlip;
	value uniform (0 0 0);
    }

}

// ************************************************************************* //
