examples/mixer/0/omega
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       volScalarField;
    location    "0";
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform 5000;

boundaryField
{
   wall-part_3-solid
    {
        type            wallFunction;
        value           uniform 5000;
    }
   in1
    {
       type            fixedValue;
        value           uniform 5000;    
    }
    in2
    {
       type            fixedValue;
        value           uniform 5000;
    }
    out
    {
         type            zeroGradient;
    }
    top
    {
        type            wallFunction;
        value           uniform 5000;
   }
}


// ************************************************************************* //
