examples/mixer/system/fvSolution
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.3                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/



FoamFile
{
	version         2.0;
	format          ascii;
	root            "/home/mangani/OpenFOAM-1.5-dev/mangani-1.5-dev/run/C3XFC/OpenFoam";
	case            "circ_bump";
	instance        "system";
	local           "";
	class           dictionary;
	object          fvSolution;
}


solvers
{
    T GAMG
    {
        tolerance        1e-15;
        relTol           0.05;

        smoother         DILU;
//        smoother         DIC;

        cacheAgglomeration off;

        nCellsInCoarsestLevel 20;
        agglomerator     faceAreaPair;
        mergeLevels      1;
    };

    Toff smoothSolver
    {
        tolerance        1e-18;
        relTol           0.001;

        smoother         DILUGaussSeidel;

        cacheAgglomeration off;

        nCellsInCoarsestLevel 20;
        agglomerator     faceAreaPair;
        mergeLevels      1;
    };

};

SIMPLE
{

	nNonOrthogonalCorrectors	0;
};

relaxationFactors
{
    T 1.0;
}
